dineshannayya/riscduino_firmware/custom_board/riscduino/boards.txt
# allow Clock Frequency selection

menu.clksrc=CPU Clock Frequency
menu.toolsloc=Tool Install Location

riscduino_score_devkit.name=Riscduino Single core DevKit

riscduino_score_devkit.menu.toolsloc.default=Default
riscduino_score_devkit.menu.toolsloc.manual=Manual
riscduino_score_devkit.menu.toolsloc.default.compiler.path={runtime.tools.riscv32-unknown-elf-gcc.path}/bin/
riscduino_score_devkit.menu.toolsloc.manual.compiler.path=

#Point to the file for ./variants/<variant>/pins_arduino.h
riscduino_score_devkit.build.variant=standard

riscduino_score_devkit.menu.clksrc.fpga=50MHz FPGA Clock
riscduino_score_devkit.menu.clksrc.fpga.build.f_cpu=50000000L

riscduino_score_devkit.build.mcu=rv32imac

#"The 'core' file directory for this board, in ./cores
riscduino_score_devkit.build.core=arduino
# This sets a define for use in the compiled code.
riscduino_score_devkit.build.board=RISCDUINO_SCORE_DEVKIT
riscduino_score_devkit.build.boardenv=riscduino_score
riscduino_score_devkit.build.sdata.size=4096
#This selects the tool from "programmers.txt"
riscduino_score_devkit.program.tool=openocd
riscduino_score_devkit.upload.tool=openocd
# Limit is the 128MB Flash. Assume half is used for something else.
riscduino_score_devkit.upload.maximum_size=8388608
riscduino_score_devkit.build.ldscript={compiler.sdk.path}/env/riscduino_score/link.lds
riscduino_score_devkit.build.openocdcfg=riscduino_score-devkit.cfg


